TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/Core/Src/main.c
  /* Switch between two buffers for ping-pong reception */
  uint8_t* buf = (uint8_t*) DMA_InitStruct.DestAddress;
  if(buf == aUSART2RxBuffer)
  {
    DMA_InitStruct.DestAddress = (uint32_t)aUSART2RxBuffer_buff1;
  }
  else
  {
    DMA_InitStruct.DestAddress = (uint32_t)aUSART2RxBuffer;
  }

  /* Reconfigure source address to USART data register */
  DMA_InitStruct.SrcAddress = LL_USART_DMA_GetRegAddr(USART2, LL_USART_DMA_REG_DATA_RECEIVE);

  /* Reinitialize DMA with updated configuration */
  LL_DMA_Init(GPDMA1, LL_DMA_CHANNEL_3, &DMA_InitStruct);

  /* Reset block data length for next transfer */
  LL_DMA_SetBlkDataLength(GPDMA1, LL_DMA_CHANNEL_3, ubUSART2NbDataToReceive);

  /* Ensure NVIC is properly configured */
  NVIC_SetPriority(GPDMA1_Channel3_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
  NVIC_EnableIRQ(GPDMA1_Channel3_IRQn);

  /* Re-enable DMA interrupts */
  LL_DMA_EnableIT_TC(GPDMA1, LL_DMA_CHANNEL_3);
  LL_DMA_EnableIT_DTE(GPDMA1, LL_DMA_CHANNEL_3);
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
void MX_GPIO_Init(void)
{
#if SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT
  GPIO_InitTypeDef GPIO_InitStruct = {0};
#endif /* CFG_LED_SUPPORTED || SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT */
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();

  /*RT DEBUG GPIO_Init */
  RT_DEBUG_GPIO_Init();

/* USER CODE BEGIN MX_GPIO_Init_2 */
#if SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT
  /*Configure GPIO pins related to the RF processing delays measurement */
  SIDEWALK_RF_TIMINGS_RXTX_START_GPIO_Port->BRR = SIDEWALK_RF_TIMINGS_RXTX_START_Pin;
  GPIO_InitStruct.Pin = SIDEWALK_RF_TIMINGS_RXTX_START_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(SIDEWALK_RF_TIMINGS_RXTX_START_GPIO_Port, &GPIO_InitStruct);

  SIDEWALK_RF_TIMINGS_WBA_AWAKE_GPIO_Port->BSRR = SIDEWALK_RF_TIMINGS_WBA_AWAKE_Pin;
  GPIO_InitStruct.Pin = SIDEWALK_RF_TIMINGS_WBA_AWAKE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(SIDEWALK_RF_TIMINGS_WBA_AWAKE_GPIO_Port, &GPIO_InitStruct);
#endif /* SID_SDK_CONFIG_RF_TIMINGS_MEASUREMENT */

#if (CFG_DEBUGGER_LEVEL == 0)
  GPIO_InitTypeDef DbgIOsInit = {0};
  DbgIOsInit.Mode = GPIO_MODE_ANALOG;
  DbgIOsInit.Pull = GPIO_NOPULL;
  DbgIOsInit.Pin = GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
  __HAL_RCC_GPIOA_CLK_ENABLE();
  HAL_GPIO_Init(GPIOA, &DbgIOsInit);

  DbgIOsInit.Mode = GPIO_MODE_ANALOG;
  DbgIOsInit.Pull = GPIO_NOPULL;
  DbgIOsInit.Pin = GPIO_PIN_3|GPIO_PIN_4;
  __HAL_RCC_GPIOB_CLK_ENABLE();
  HAL_GPIO_Init(GPIOB, &DbgIOsInit);
#endif /* CFG_DEBUGGER_LEVEL */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

void HAL_FLASHEx_EccCorrectionCallback(void)
{
#if defined(FLASH_DBANK_SUPPORT)
  const uint32_t physical_bank_id = READ_BIT(FLASH->ECCR, FLASH_ECCR_BK_ECC);
  const uint32_t bank_swap_active = READ_BIT (FLASH->OPTR, FLASH_OPTR_SWAP_BANK_Msk);
  const uint32_t flash_base_addr = FLASH_BASE + (
    (((physical_bank_id == 0u) && (bank_swap_active == OB_SWAP_BANK_DISABLE)) || ((physical_bank_id != 0u) && (bank_swap_active != OB_SWAP_BANK_DISABLE)))
    ? 0u /* Physical bank 1 and no bank swap OR physical bank 2 and bank swap active */
    : (FLASH_SIZE >> 1u) /* Physical bank 2 and no bank swap OR physical bank 1 and bank swap active */
  );
#else
  const uint32_t flash_base_addr = FLASH_BASE;
#endif /* FLASH_DBANK_SUPPORT */
  const uint32_t correction_address = ((READ_BIT(FLASH->ECCR, FLASH_ECCR_SYSF_ECC) == 0u) ? flash_base_addr : SYSTEM_FLASH_BASE_NS)
      + ((FLASH->ECCR & FLASH_ECCR_ADDR_ECC_Msk) >> FLASH_ECCR_ADDR_ECC_Pos);

  if (FLASH_ECC_TEST_SINGLE_ERROR_ADDRESS == correction_address)
  {
    SID_PAL_LOG_INFO("Single ECC error correction test succeeded");
  }
  else
  {
    SID_PAL_LOG_WARNING("ECC correction occured in flash at address 0x%08X", correction_address);
  }
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  __disable_irq();

  SID_PAL_LOG_ERROR("\e[1;35m" "ASSERT" "\e[0m" " line %u %s", line, file);
  Error_Handler();
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
